app/Controllers/login_controller.php

SELECT *
FROM `usuario`
WHERE `usuario` = 'justo98'
 LIMIT 1
---
    public function auth(){
        $session = session();
        $model = new usuario_model();

        //Traemos los datos del formulario
        $usuario = $this->request->getVar('usuario');
        $password = $this->request->getVar('password');

        $data = $model->where('usuario',$usuario)->first();