app/Controllers/usuario_controller.php

INSERT INTO `usuario` (`nombre`, `apellido`, `usuario`, `email`, `password`) VALUES ('Jose', 'Fernandez', 'Jose1995', 'jose1995@gmail.com', '$2y$10$Eycdgyfh1rcR1p4FtStet.1mBAUVnvlEU8nJiXQRrTMNitIIpWFpG')
---
    public function formValidation()
    {
        $validation = \Config\Services::validation();
        $input = $this->validate($this->getValidationRules(), $this->getValidationMessages());

        $formModel = new usuario_model();
        if (!$input) {
            $data['titulo'] = 'Registro';
            echo view('common/head', $data);
            echo view('common/navbar');
            echo view('backend/usuario/registro', ['validation' => $this->validator]);
            echo view('common/scripts');
        } else {
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ]);

UPDATE `usuario` SET `nombre` = 'Maria Elena', `apellido` = 'Soto', `usuario` = 'mari74', `email` = 'mari74@gmail.com', `perfil_id` = '2'
WHERE `usuario`.`id_usuario` IN ('2')
---
                'perfil_id' => $this->request->getVar('perfil_id')
            ];

            if ($userModel->update($id_usuario, $data)) {

UPDATE `usuario` SET `baja` = 'SI'
WHERE `usuario`.`id_usuario` IN ('5')
---
    public function baja_logica_usuario($id_usuario)
    {
        $userModel = new usuario_model();
        $data = ['baja' => 'SI'];

        if ($userModel->update($id_usuario, $data)) {