app/Models/usuario_model.php

    public function getUsuariosNoElim()
    {
        return $this->where('baja', 'NO')->findAll();
---
SELECT *
FROM `usuario`
WHERE `baja` = 'NO'

    public function getUsuariosElim()
    {
        return $this->where('baja', 'SI')->findAll();
---
SELECT *
FROM `usuario`
WHERE `baja` = 'SI'

    public function getUserId($id_usuario)
    {
        return $this->where('id_usuario', $id_usuario)->first();
---
SELECT *
FROM `usuario`
WHERE `id_usuario` = '1'
 LIMIT 1